incompressible/pimpleKinematicFoam/cycloneErosion/0.org/U
/*---------------------------------------------------------------------------*
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    body
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (-5 0 0);
    }
    inlet-walls
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
    overflow
    {
        type            zeroGradient;
    }
    underflow
    {
        type            zeroGradient;
    }
    vortexfinder
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
