incompressible/pimpleKinematicFoam/cycloneErosion/constant/cloudSettings
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          cloudSettings;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nClouds 1;


