incompressible/pimpleKinematicFoam/cycloneErosion/constant/particleTrackProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      particleTrackProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cloudName       kinematicCloud; //reactingCloud1;

sampleFrequency 1;

maxPositions    20000000; //1000000;

setFormat       vtk;    // see sampleDict for set formats

// ************************************************************************* //
