incompressible/pimpleKinematicFoam/cycloneErosion/system/changeDictionaryDict
/*---------------------------------------------------------------------------*
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


boundary
{
    "inlet.*|overflow.*|underflow.*"
    {
	type            patch;
    }

    "body.*|inlet-walls.*|vortexfinder.*"
    {
	type            wall;
    }  
}
    

// ************************************************************************* //
